{
  "backend/main.mo": "Main Motoko canister implementing authorization, user profiles, and CRUD stores for study materials, test series, previous papers, and daily pollution entries.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding daily pollution store and related counters.",
  "feature_evidence.json": "Feature evidence report mapping new pollution-related frontend features to impacted files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables, dark mode values, and core theme tokens.",
  "frontend/index.html": "Basic HTML entry point containing root div and script loader for the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for landing and admin pages and wraps app with React Query provider and Toaster.",
  "frontend/src/components/admin/AdminGuard.tsx": "Protects admin routes by checking authentication and role, showing appropriate UI for loading, errors, or denial.",
  "frontend/src/components/CurrentAffairsSection.tsx": "React component rendering multilingual, timeframe-filtered current affairs using tabs, selectors, and card layout.",
  "frontend/src/components/DailyPollutionSection.tsx": "Shows daily pollution data with day selector, loading/error states, and cards for pollution entries.",
  "frontend/src/components/DailyTestSeriesSection.tsx": "Displays daily test series with day filtering, handling loading/errors, and showing test cards with resource links.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/PreviousYearPapersSection.tsx": "Renders categorized static lists of prelims and mains previous year papers with card layouts.",
  "frontend/src/components/ShareThisApp.tsx": "Offers a shareable link UI allowing users to copy the current URL with feedback.",
  "frontend/src/components/StudyMaterialSection.tsx": "Fetches and filters study materials or previous papers by exam and language, displaying items or textbook fallbacks.",
  "frontend/src/data/currentAffairsSample.ts": "Defines types and sample multilingual current affairs data organized by timeframe and language.",
  "frontend/src/data/studyMaterialSample.ts": "Provides type definitions for exam categories and languages; actual data is now backend-driven.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, logout, and identity state handling via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for user profiles, roles, study materials, previous papers, and test series.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables for the app's visual palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminContentManagerPage.tsx": "Admin UI for managing study materials, papers, test series, and pollution entries with form state and related queries/mutations.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with hero section, header, and navigation to admin and previous-year papers, integrating various study-related sections.",
  "frontend/src/utils/dayKey.ts": "Utility functions to convert between dates and numeric day keys, including formatting and generating recent day ranges.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings with custom plugins.",
  "project_state.json": "Metadata describing the app’s current requirements, features, issues, and architectural notes for the upscQueen project."
}