{
  "backend/main.mo": "Main backend actor handling user profiles, study materials, and previous year papers with role‑based access control.",
  "backend/migration.mo": "Migration module that seeds initial study materials and merges them with existing store during upgrade.",
  "feature_evidence.json": "Feature evidence report documenting seeded study material feature and associated frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for reference during build planning.",
  "frontend/index.css": "Tailwind base styles defining color variables, themes, and global styling rules including dark mode.",
  "frontend/index.html": "Basic HTML entry point loading the React app root element and main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router and React Query providers with routes for landing and admin pages.",
  "frontend/src/components/admin/AdminGuard.tsx": "Protects admin routes by checking authentication and user role, showing appropriate loading or access-denied states.",
  "frontend/src/components/CurrentAffairsSection.tsx": "UI section showing current affairs with language selector and timeframe tabs.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/PreviousYearPapersSection.tsx": "Displays static UPSC prelims and mains paper listings with disabled download buttons.",
  "frontend/src/components/ShareThisApp.tsx": "UI component that displays the current URL and lets users copy it with feedback toasts.",
  "frontend/src/components/StudyMaterialSection.tsx": "Renders study materials and previous papers with filters, tabs, and textbook fallback cards using backend data.",
  "frontend/src/data/currentAffairsSample.ts": "Provides static sample current affairs data structured by timeframe and language.",
  "frontend/src/data/studyMaterialSample.ts": "Exports type definitions for exam categories and languages; data now supplied by backend.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, managing login, stored identities, and session state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, study materials, and previous year papers through an actor API.",
  "frontend/src/index.css": "Configures Tailwind base styles and sets CSS variables for light and dark mode color themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminContentManagerPage.tsx": "Implements an admin-only interface to view, add, and delete study materials and previous year papers.",
  "frontend/src/pages/LandingPage.tsx": "Defines the public landing page with hero content, navigation, and sections for study resources and papers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and enabling plugins.",
  "project_state.json": "Tracks project schema version, feature requirements, architectural notes, and known issues for building the multilingual upscQueen web app. Contains user scope expansions for study materials, current affairs, and branding details."
}