{
  "kind": "build_request",
  "title": "Add NCERT and GCRT textbooks as in-app Study Material content",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Seed the backend Study Material store with a starter set of NCERT textbooks and GCRT textbooks so they appear in the existing Study Material section without requiring any admin upload.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "NCERT તથા જીસીઆરટીના પાઠ્યપુસ્તક અંદર એડ કરો"
        ]
      },
      "acceptanceCriteria": [
        "After deployment, opening the Landing Page and scrolling to the Study Material section shows at least one NCERT textbook item and at least one GCRT textbook item (as Study Material cards), without needing to log in.",
        "NCERT textbook items are stored as Study Material entries in the backend with ContentType set to a book-like type (e.g., PdfBook/Book) and a non-empty title.",
        "GCRT textbook items are stored as Study Material entries in the backend with ContentType set to a book-like type (e.g., PdfBook/Book) and a non-empty title.",
        "Seed logic does not create duplicate entries on repeated canister starts within the same running deployment (e.g., only seeds when the store is empty).",
        "All user-facing text in the UI remains in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit any files under frontend/src/components/ui or other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Only Internet Identity is used for authentication; do not add third-party auth providers."
  ],
  "nonGoals": [
    "Do not implement actual PDF hosting, file uploads, or an in-app PDF reader in this change (links can remain placeholders if real URLs are not provided).",
    "Do not redesign the Study Material taxonomy (exam/language tabs) unless required to make seeded items visible."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}