{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Surface seeded NCERT/GCRT textbooks in Study Material section",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Ensure the Landing Page Study Material section visibly lists seeded NCERT and GCRT textbook Study Material items (book-like content types) without requiring login, even if their backend subject taxonomy differs from current UI filters.",
      "acceptanceCriteria": [
        "After deployment, opening the Landing Page and scrolling to the Study Material section shows at least one NCERT textbook item and at least one GCRT textbook item (as Study Material cards), without needing to log in.",
        "NCERT textbook items are stored as Study Material entries in the backend with ContentType set to a book-like type (e.g., PdfBook/Book) and a non-empty title.",
        "GCRT textbook items are stored as Study Material entries in the backend with ContentType set to a book-like type (e.g., PdfBook/Book) and a non-empty title.",
        "Seed logic does not create duplicate entries on repeated canister starts within the same running deployment (e.g., only seeds when the store is empty).",
        "All user-facing text in the UI remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StudyMaterialSection.tsx",
          "operation": "modify",
          "description": "Update the Study Material UI to include a small 'Featured Textbooks' (or equivalent) subsection that always renders when study materials are available, prioritizing items whose titles indicate NCERT and GCRT and whose contentType is Book/PdfBook; keep all user-facing text in English and avoid changing any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StudyMaterialSection.tsx",
          "operation": "modify",
          "description": "Add a graceful fallback when the current exam/language filter yields zero results: still provide a way to display book-like Study Material items (Book/PdfBook) from the fetched list so seeded textbooks remain visible without taxonomy redesign; include an external-link style action only when item.url is non-empty (no in-app PDF reader). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Confirm the Landing Page continues to render the StudyMaterialSection in the main public flow and that navigation/scroll access to the Study Material section remains intact for anonymous users; keep all visible text in English. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}